//在场景中 "标记" 出某个物体的形状，但不实际显示任何颜色
//用在模板测试，的球中抠图用


Shader "ZChapter4/ZChapter4_2_A"
{
   
    SubShader
    {
        Tags { "Queue" = "Geometry-1" }//Z： Geometry是普通不透明物体，"Geometry-1" 表示比普通物体先渲染（值为 1999）；作用：先画，画在其他物体前面
        LOD 100

        Pass
        {
            //Z：设置模板测试的状态[Z：这个物体渲染过的所有像素位置，都会在模板缓冲里 "打个标记 1"，其他没被覆盖的区域还是默认值 0，]
            //Z： Shader 中模板测试（Stencil Test）的设置，可以理解为 "给屏幕上的像素打标记" 的规则
            Stencil{//*********************************************************************************
                Ref 1         //模板参考值设置为1(Z：可以理解为，准备用 "1 号印章" 来做标记)
                Comp Always   //不管当前模板缓冲是什么值都通过测试（Z：Comp是 "比较规则"，Always表示 "不管当前位置有没有标记、是什么标记，都允许通过测试"）
                Pass Replace  //通过后，将模板缓冲对应位置的值设置为1（Z：Pass是 "通过测试后的操作"，Replace表示 "把当前位置的标记换成参考值 1"）

            }

            //Z：通俗说："我虽然画了，但既不显示颜色，也不会挡住后面的东西，只偷偷在模板缓冲里做标记"
            //禁止绘制任何色彩到渲染目标？？？？？？
            ColorMask 0       //禁用颜色通道的写入（Z：禁用颜色输出，不管片段着色器返回什么颜色，都不会画到屏幕上（完全透明））**********************
            ZWrite off        //禁用深度写入（Z：也就是说，不会影响其他物体的遮挡关系）*************************************************************

            //开始编写GC代码
            CGPROGRAM
            #pragma vertex vert
            #pragma fragment frag


            //Z：顶点着色器负责 "把 3D 模型正确放到屏幕上"，片段着色器负责 "给屏幕上的每个像素上色"。这段代码的效果是 "让模型在屏幕上占位，但不显示任何颜色"（相当于一个 "隐形的形状"）
            float4  vert (in float4 vertex : POSITION):SV_POSITION    //Z：in float4 vertex : POSITION：输入模型自身的顶点坐标；
                                                                      //:SV_POSITION：输出的坐标是 "裁剪空间坐标"返回输出的坐标是 "裁剪空间坐标"
                                                                      //Z：in表示输入参数；这里的in表示：vertex是从外部传入的 "模型顶点坐标"，函数只是用这个坐标来计算，不会修改原始的顶点数据。
            {
               float4 pos = UnityObjectToClipPos(vertex); //将模型空间的顶点转换到剪裁空间
               return pos;                                //返回剪裁空间的顶点位置   (Z：剩下的裁剪空间→屏幕空间转换，由 GPU 底层自动完成，不需要我们写代码)
            }
            
            //片段着色器（Z：像素都透明）
             void frag (out fixed4 color : SV_Target)//Z：out fixed4 color : SV_Target：输出的颜色会直接画到屏幕上（SV_Target 就是 "屏幕目标" 的意思）。
                                                     //Z：out表示输出参数；这里的out表示：color是要从函数输出的 "像素颜色"，函数必须计算出一个颜色值赋给它，最终这个颜色会被画到屏幕上
            {
                color = fixed4(0, 0, 0, 0); // 输出透明的颜色（完全不可见）
            }
            ENDCG
        }
    }
}
